---
kind: type
id: T:Autodesk.Revit.DB.TextNode
source: html/9a06448a-1c82-7fd7-8be7-9113dc1ce86a.htm
---
# Autodesk.Revit.DB.TextNode

This class represents a text annotation object in a model-exporting process.

## Syntax (C#)
```csharp
public class TextNode : RenderNode
```

## Remarks
See also: OnText(TextNode) .